# Project 2 Part 3B
**Transform and Load (core)**


*Christina Brockway*

### Task
- Take the cleaned data and add stakeholder data to SQL database
- Genres
    -  use title basics from part 1
    -  extract and normalize column
- New Table from API calls
    -  Tmdb_data table
        -  imdb_id
        -  revenue
        -  budget
        -  certification

### Imports

In [1]:
import numpy as np
import pandas as pd
import matplotlib.pyplot as plt
import seaborn as sns
import json, os
import plotly.express as px
from sqlalchemy import create_engine
from sqlalchemy_utils import database_exists, create_database
import pymysql
pymysql.install_as_MySQLdb()
from urllib.parse import quote_plus as urlquote

### Load data and Inspect

In [2]:
basics = pd.read_csv('MovieData/basics-filter.csv')

In [3]:
basics.head(2)

,Unnamed: 0,tconst,titleType,primaryTitle,originalTitle,isAdult,startYear,endYear,runtimeMinutes,genres
0,34800,tt0035423,movie,Kate & Leopold,Kate & Leopold,0,2001.0,NaN,118,"Comedy,Fantasy,Romance"
1,61111,tt0062336,movie,The Tango of the Widower and Its Distorting Mi...,El tango del viudo y su espejo deformante,0,2020.0,NaN,70,Drama

In [4]:
basics.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 86972 entries, 0 to 86971
Data columns (total 10 columns):
 #   Column          Non-Null Count  Dtype
---  ------          --------------  -----
 0   Unnamed: 0      86972 non-null  int64
 1   tconst          86972 non-null  object
 2   titleType       86972 non-null  object
 3   primaryTitle    86972 non-null  object
 4   originalTitle   86972 non-null  object
 5   isAdult         86972 non-null  int64
 6   startYear       86972 non-null  float64
 7   endYear         0 non-null      float64
 8   runtimeMinutes  86972 non-null  int64
 9   genres          86972 non-null  object
dtypes: float64(2), int64(3), object(5)
memory usage: 6.6+ MB

## Normalize Data

### Generes

In [6]:
# screate a new column with a list of genres
basics['genres_split']= basics['genres'].str.split(",")
basics.head(2)

,Unnamed: 0,tconst,titleType,primaryTitle,originalTitle,isAdult,startYear,endYear,runtimeMinutes,genres,genres_split
0,34800,tt0035423,movie,Kate & Leopold,Kate & Leopold,0,2001.0,NaN,118,"Comedy,Fantasy,Romance","[Comedy, Fantasy, Romance]"
1,61111,tt0062336,movie,The Tango of the Widower and Its Distorting Mi...,El tango del viudo y su espejo deformante,0,2020.0,NaN,70,Drama,[Drama]

In [9]:
basics=basics.drop(columns='Unnamed: 0')
basics.head(2)

,tconst,titleType,primaryTitle,originalTitle,isAdult,startYear,endYear,runtimeMinutes,genres,genres_split
0,tt0035423,movie,Kate & Leopold,Kate & Leopold,0,2001.0,NaN,118,"Comedy,Fantasy,Romance","[Comedy, Fantasy, Romance]"
1,tt0062336,movie,The Tango of the Widower and Its Distorting Mi...,El tango del viudo y su espejo deformante,0,2020.0,NaN,70,Drama,[Drama]

In [10]:
#Seperate list of genres
exploded_genres = basics.explode('genres_split')
exploded_genres.head(2)

,tconst,titleType,primaryTitle,originalTitle,isAdult,startYear,endYear,runtimeMinutes,genres,genres_split
0,tt0035423,movie,Kate & Leopold,Kate & Leopold,0,2001.0,NaN,118,"Comedy,Fantasy,Romance",Comedy
0,tt0035423,movie,Kate & Leopold,Kate & Leopold,0,2001.0,NaN,118,"Comedy,Fantasy,Romance",Fantasy

In [11]:
#get unique genres from the split
unique_genres =  sorted(exploded_genres['genres_split'].unique())

In [12]:
# Create new table for title_genres
title_genres = exploded_genres[['tconst', 'genres_split']].copy()
title_genres.head(2)

      tconst genres_split
0  tt0035423       Comedy
0  tt0035423      Fantasy

In [13]:
#Create a gene mapper dictionary
genre_init = range(len(unique_genres))
genre_map = dict(zip(unique_genres, genre_init))
genre_map

{'Action': 0,
 'Adult': 1,
 'Adventure': 2,
 'Animation': 3,
 'Biography': 4,
 'Comedy': 5,
 'Crime': 6,
 'Drama': 7,
 'Family': 8,
 'Fantasy': 9,
 'Game-Show': 10,
 'History': 11,
 'Horror': 12,
 'Music': 13,
 'Musical': 14,
 'Mystery': 15,
 'News': 16,
 'Reality-TV': 17,
 'Romance': 18,
 'Sci-Fi': 19,
 'Sport': 20,
 'Talk-Show': 21,
 'Thriller': 22,
 'War': 23,
 'Western': 24}

In [17]:
#Add genres_id column
title_genres['genres_id'] = title_genres['genres_split'].map(genre_map)
#Drop genres split column
title_genres = title_genres.drop(columns='genres_split')
title_genres.head(2)

      tconst  genres_id
0  tt0035423          5
0  tt0035423          9

### Genres Dataframe

In [22]:
#Make a dataframe with named cols from the keys and values
genres = pd.DataFrame({"genre_name": genre_map.keys(),
                             "genre_id": genre_map.values()})
genres.head()

  genre_name  genre_id
0     Action         0
1      Adult         1
2  Adventure         2
3  Animation         3
4  Biography         4

### tmdb_data table

#### Load tmdb_data

In [24]:
tmdb_df = pd.read_csv('MovieData/tmdb_results_combined.csv.gz')
tmdb_df.head(2)

,imdb_id,adult,backdrop_path,belongs_to_collection,budget,genres,homepage,id,original_language,original_title,...,revenue,runtime,spoken_languages,status,tagline,title,video,vote_average,vote_count,certification
0,tt0035423,0.0,/tJLV3BAlHOgscVOrA99Wnb2gAef.jpg,NaN,48000000.0,"[{'id': 10749, 'name': 'Romance'}, {'id': 14, ...",NaN,11232.0,en,Kate & Leopold,...,76019048.0,118.0,"[{'english_name': 'French', 'iso_639_1': 'fr',...",Released,"If they lived in the same century, they'd be p...",Kate & Leopold,0.0,6.320,1237.0,PG-13
1,tt0118589,0.0,/9NZAirJahVilTiDNCHLFcdkwkiy.jpg,NaN,22000000.0,"[{'id': 18, 'name': 'Drama'}, {'id': 10402, 'n...",NaN,10696.0,en,Glitter,...,5271666.0,104.0,"[{'english_name': 'English', 'iso_639_1': 'en'...",Released,"In music she found her dream, her love, herself.",Glitter,0.0,4.405,132.0,PG-13